In [1]:
import pandas as pd

In [2]:
bank_users_df = pd.read_csv("data/bank_users.csv", usecols=["last_name"])
bank_users_df

    last_name
0       Gotts
1      Linsey
2      Gorton
3    Steanyng
4    Cockaday
..        ...
195      Oppy
196   Labbati
197   Cordery
198  Laughren
199   Peckitt

[200 rows x 1 columns]

Toto je View:

In [4]:
bank_users_sr = bank_users_df.squeeze("columns")
bank_users_sr

0         Gotts
1        Linsey
2        Gorton
3      Steanyng
4      Cockaday
         ...
195        Oppy
196     Labbati
197     Cordery
198    Laughren
199     Peckitt
Name: last_name, Length: 200, dtype: object

In [6]:
bank_users_sr[0] = "Šetek"
bank_users_sr.head()

0       Šetek
1      Linsey
2      Gorton
3    Steanyng
4    Cockaday
Name: last_name, dtype: object

In [7]:
bank_users_df

    last_name
0       Šetek
1      Linsey
2      Gorton
3    Steanyng
4    Cockaday
..        ...
195      Oppy
196   Labbati
197   Cordery
198  Laughren
199   Peckitt

[200 rows x 1 columns]

Teď chci zkusit Copy:

In [8]:
import pandas as pd

In [10]:
bank_users_DataFrame = pd.read_csv("data/bank_users.csv", usecols=["last_name"])
bank_users_DataFrame

    last_name
0       Gotts
1      Linsey
2      Gorton
3    Steanyng
4    Cockaday
..        ...
195      Oppy
196   Labbati
197   Cordery
198  Laughren
199   Peckitt

[200 rows x 1 columns]

In [16]:
bank_users_Series = bank_users_DataFrame.squeeze("columns").copy()
bank_users_Series

0         Gotts
1        Linsey
2        Gorton
3      Steanyng
4      Cockaday
         ...
195        Oppy
196     Labbati
197     Cordery
198    Laughren
199     Peckitt
Name: last_name, Length: 200, dtype: object

In [18]:
bank_users_Series[0] = "Potter"
bank_users_Series.head()

0      Potter
1      Linsey
2      Gorton
3    Steanyng
4    Cockaday
Name: last_name, dtype: object

In [20]:
bank_users_DataFrame.head()

  last_name
0     Gotts
1    Linsey
2    Gorton
3  Steanyng
4  Cockaday